# St7SetGeometryFaceTempGradient1

Assigns a temperature gradient to the specified geometry face.

long St7SetGeometryFaceTempGradient1(long uID, long FaceNum, long CaseNum,
double* Doubles)
Input Parameters
uID
Strand7 model file ID.
FaceNum
Face number.
CaseNum
Load case number.
Doubles[0]
Temperature gradient.